Autodesk.Revit.Exceptions.RevitServerCollaborationNotAvailableException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Retrieves data needed to serialize the target object.
info:
Data needed to serialize or deserialize the object.
context:
The destination of the serialized stream.

Autodesk.Revit.Exceptions.RevitServerCollaborationNotAvailableException
The exception that is thrown when Collaboration fails because of an external resource (e.g., Amazon S3) failure.